#Область ОписаниеПеременных
&НаКлиенте
Перем ПредыдущаяДатаНачалаОтпуска;
&НаКлиенте
Перем ПредыдущаяДатаОкончанияОтпуска;
&НаКлиенте
Перем ПредыдущаяДатаНачалаПериода;
&НаКлиенте
Перем ПредыдущаяДатаКонцаПериода;
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ВалидацияДатПериода(Объект.НачалоПериода, ПредыдущаяДатаНачалаПериода);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ВалидацияДатПериода(Объект.КонецПериода, ПредыдущаяДатаКонцаПериода);
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПредыдущаяДатаНачалаПериода = Объект.НачалоПериода;
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаНачалаПериода = Объект.НачалоПериода;
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПредыдущаяДатаКонцаПериода = Объект.КонецПериода;
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаКонцаПериода = Объект.КонецПериода;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников
&НаКлиенте
Процедура СписокСотрудниковДатаНачалаОтпускаПриИзменении(Элемент)
	ЗаполнитьПолеКоличествоДней(Элементы.СписокСотрудников.ТекущиеДанные,
		Элементы.СписокСотрудников.ТекущиеДанные.ДатаНачалаОтпуска, ПредыдущаяДатаНачалаОтпуска);
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаОкончанияОтпускаПриИзменении(Элемент)
	ЗаполнитьПолеКоличествоДней(Элементы.СписокСотрудников.ТекущиеДанные,
		Элементы.СписокСотрудников.ТекущиеДанные.ДатаОкончанияОтпуска, ПредыдущаяДатаОкончанияОтпуска);
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаНачалаОтпускаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаНачалаОтпуска = Элементы.СписокСотрудников.ТекущиеДанные.ДатаНачалаОтпуска;
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаНачалаОтпускаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПредыдущаяДатаНачалаОтпуска = Элементы.СписокСотрудников.ТекущиеДанные.ДатаНачалаОтпуска;
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаОкончанияОтпускаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаОкончанияОтпуска = Элементы.СписокСотрудников.ТекущиеДанные.ДатаОкончанияОтпуска;
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаОкончанияОтпускаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
	СтандартнаяОбработка)
	ПредыдущаяДатаОкончанияОтпуска = Элементы.СписокСотрудников.ТекущиеДанные.ДатаОкончанияОтпуска;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВалидацияДатПериода(Дата, ПредыдущаяДата)
	//Если значение пустое
	Если Дата = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;
	//Если дата начала больше даты окончания
	Если Не Объект.КонецПериода = Дата('00010101') И Объект.НачалоПериода >= Объект.КонецПериода Тогда
		ПоказатьПредупреждение( , "Дата начала периода не должна быть больше даты окончания!");
		Объект.НачалоПериода = ПредыдущаяДата;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолеКоличествоДней(ТекущиеДанные, ДатаНачалаИлиОкончания, ПредыдущаяДата)
	//--Блок валидации дат--
	//Если пустое значение
	Если ДатаНачалаИлиОкончания = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;
	
	//Если не заданы даты периода 
	Если Объект.НачалоПериода = Дата('00010101') Или Объект.КонецПериода = Дата('00010101') Тогда
		ПоказатьПредупреждение( , "Необходимо сперва задать даты периода!");
		ДатаНачалаИлиОкончания = Дата('00010101');
		Возврат;
	КонецЕсли;
	
	//Если дата не в пределах периода
	Если Не (ДатаНачалаИлиОкончания >= Объект.НачалоПериода И ДатаНачалаИлиОкончания <= Объект.КонецПериода) Тогда
		ПоказатьПредупреждение( , "Дата должна находится в пределах периода!");
		ДатаНачалаИлиОкончания = ПредыдущаяДата;
		Возврат;
	КонецЕсли;

	//Если одна из дат пустая
	Если ТекущиеДанные.ДатаНачалаОтпуска = Дата('00010101') Или ТекущиеДанные.ДатаОкончанияОтпуска = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;
	
	//Если дата окончания и начала перепутаны местами
	Если ТекущиеДанные.ДатаОкончанияОтпуска < ТекущиеДанные.ДатаНачалаОтпуска Тогда
		ПоказатьПредупреждение( , "Окончание отпуска не должно начинаться раньше начала отпуска!");
		ДатаНачалаИлиОкончания = ПредыдущаяДата;
		Возврат;
	КонецЕсли;
	//----------------------------------------------------------------------------------------------------------------

	ТекущиеДанные.КоличествоДней = (НачалоДня(ТекущиеДанные.ДатаОкончанияОтпуска) - НачалоДня(
		ТекущиеДанные.ДатаНачалаОтпуска)) / (24 * 60 * 60);
КонецПроцедуры
#КонецОбласти