#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников
&НаКлиенте
Процедура СписокСотрудниковДатаНачалаОтпускаПриИзменении(Элемент)
	ЗаполнитьПолеКоличествоДней(Элементы.СписокСотрудников.ТекущиеДанные,
		Элементы.СписокСотрудников.ТекущиеДанные.ДатаНачалаОтпуска);
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаОкончанияОтпускаПриИзменении(Элемент)
	ЗаполнитьПолеКоличествоДней(Элементы.СписокСотрудников.ТекущиеДанные,
		Элементы.СписокСотрудников.ТекущиеДанные.ДатаОкончанияОтпуска);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗаполнитьПолеКоличествоДней(ТекущиеДанные, ДатаНачалаИлиОкончания)
	Если ТекущиеДанные.ДатаНачалаОтпуска = Дата('00010101') Или ТекущиеДанные.ДатаОкончанияОтпуска = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ДатаОкончанияОтпуска < ТекущиеДанные.ДатаНачалаОтпуска Тогда
		ПоказатьПредупреждение( , "Окончание отпуска не должно начинаться раньше начала отпуска!");
		ДатаНачалаИлиОкончания = Дата('00010101');
		Возврат;
	КонецЕсли;
	ТекущиеДанные.КоличествоДней = (НачалоДня(ТекущиеДанные.ДатаОкончанияОтпуска) - НачалоДня(
		ТекущиеДанные.ДатаНачалаОтпуска)) / (24 * 60 * 60);
КонецПроцедуры
#КонецОбласти