#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр РегистрПроизводственногоКалендаря
	Движения.РегистрПроизводственногоКалендаря.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаИзмененийКалендаря из ТаблицаИзмененийКалендаря Цикл
		Движение = Движения.РегистрПроизводственногоКалендаря.Добавить();
		Движение.Год = Год;
		Движение.ДатаИзмененияКалендаря = ТекСтрокаТаблицаИзмененийКалендаря.Дата;
		Движение.СтатусДня = ТекСтрокаТаблицаИзмененийКалендаря.СтатусДня;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли