#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ГрафикОтпусков
	Движения.ГрафикОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть из ТабличнаяЧасть Цикл
		Движение = Движения.ГрафикОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаТабличнаяЧасть.Сотрудник;
		Движение.НачалоПериода = НачалоПериода;
		Движение.КонецПериода = КонецПериода;
		Движение.КоличествоДней = ТекСтрокаТабличнаяЧасть.КоличествоДней;
		Движение.ДатаНачалаОтпуска = ТекСтрокаТабличнаяЧасть.ДатаНачалаОтпуска;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли