#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ИсторияГрафикаОтпусков
	Движения.ИсторияГрафикаОтпусков.Записывать = Истина;
	Для Каждого СтрокаТЧ из СписокСотрудников Цикл
		Движение = Движения.ИсторияГрафикаОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.НачалоПериода = НачалоПериода;
		Движение.КонецПериода = КонецПериода;
		Движение.Сотрудник = СтрокаТЧ.Сотрудник;
		Движение.ДатаНачалаОтпуска = СтрокаТЧ.ДатаНачалаОтпуска;
		Движение.КоличествоДней = СтрокаТЧ.КоличествоДней;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли