#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РуководительПроектаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных();
	Элемент = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Элемент.Использование = Истина;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Должность");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = ВернутьСсылкуНаЗаписьРуководительПроекта();
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКД);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элементы.РуководительПроекта);	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомандаПроекта
&НаКлиенте
Процедура КомандаПроектаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Сотрудник = Элемент.ТекущиеДанные.Сотрудник;
	Если ПересекаетсяЛиСотрудникСГрафикомОтпусков(Сотрудник, Объект.ДатаНачала, Объект.ДатаОкончания) Тогда
		ПоказатьПредупреждение(,"Отпуск сотрудника пересекается с проектом!",,);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПересекаетсяЛиСотрудникСГрафикомОтпусков(Сотрудник, НачалоПроекта, КонецПроекта)

	//Запрос к документу График Отпусков
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГрафикОтпусков.НачалоПериода КАК НачалоПериода,
		|	ГрафикОтпусков.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ГрафикОтпусков КАК ГрафикОтпусков";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	НачалоПериода = ВыборкаДетальныеЗаписи.НачалоПериода;
	КонецПериода = ВыборкаДетальныеЗаписи.КонецПериода;
	
	//Запрос к регистру История Графика Отпусков
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода,
		|	ИсторияГрафикаОтпусковСрезПоследних.КонецПериода,
		|	ИсторияГрафикаОтпусковСрезПоследних.Сотрудник,
		|	ИсторияГрафикаОтпусковСрезПоследних.ДатаНачалаОтпуска,
		|	ИсторияГрафикаОтпусковСрезПоследних.КоличествоДней КАК КоличествоДней
		|ИЗ
		|	РегистрСведений.ИсторияГрафикаОтпусков.СрезПоследних КАК ИсторияГрафикаОтпусковСрезПоследних
		|ГДЕ
		|	ИсторияГрафикаОтпусковСрезПоследних.Сотрудник = &Сотрудник
		|	И ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода = &НачалоПериода
		|	И ИсторияГрафикаОтпусковСрезПоследних.КонецПериода = &КонецПериода";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий(); 
	
	НачалоОтпуска = ВыборкаДетальныеЗаписи.ДатаНачалаОтпуска;
	КонецОтпуска = 
		ВыборкаДетальныеЗаписи.ДатаНачалаОтпуска + ВыборкаДетальныеЗаписи.КоличествоДней * 86400;
	
	Результат = (НачалоПроекта <= КонецОтпуска И КонецПроекта >= НачалоОтпуска);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВернутьСсылкуНаЗаписьРуководительПроекта()
    Возврат Справочники.Должности.РуководительПроекта;
КонецФункции
#КонецОбласти