//TODO: Реализовать проверку пересечений с производственным календарем
//Реализовать проверку пересечений с отпуском сотрудника
//Реализовать проверку дат проекта на валидность
#Область ОписаниеПеременных
&НаКлиенте
Перем ПредыдущаяДатаНачалаИнтервала;
&НаКлиенте
Перем ПредыдущаяДатаКонцаИнтервала;
&НаКлиенте
Перем ТекущаяДата;
&НаКлиенте
Перем ПредыдущаяДатаНачалаПроекта;
&НаКлиенте
Перем ПредыдущаяДатаОкончанияПроекта;
#КонецОбласти
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
//	ЗаполнитьИнтервалыВТаблЧасти();
//	АктуализируемПериодГрафикаОтпусков();
//	ПроверкаПересеченияСотрудниковСГрафикомОтпусков();
	Если Объект.ДатаНачала = Дата('00010101') Или Объект.ДатаОкончания = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;
	ИнициализироватьДиаграммуГанта();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РуководительПроектаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьСотрудниковИОтфильтроватьПоДолжности(Элемент, ВернутьДолжностьРуководительПроекта(),
		Элементы.РуководительПроекта);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	//Если пытаемся править задним числом
	Если Не ПредыдущаяДатаНачалаПроекта = Дата('00010101') И ПредыдущаяДатаНачалаПроекта < НачалоДня(ТекущаяДата()) Тогда
		ПоказатьПредупреждение( , "Нельзя править дату проекта задним числом!");
		Объект.ДатаНачала = ПредыдущаяДатаНачалаПроекта;
		Возврат;
	КонецЕсли;
	//Если текущее значение меньше текущего дня
	Если Объект.ДатаНачала < НачалоДня(ТекущаяДата()) Тогда
		ПоказатьПредупреждение( , "Дата начала проекта не должна быть меньше текущей даты!");
		Объект.ДатаНачала = ПредыдущаяДатаНачалаПроекта;
		Возврат;
	КонецЕсли;
	ИнициализироватьДиаграммуГанта();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	//Если пытаемся править задним числом
	Если Не ПредыдущаяДатаОкончанияПроекта = Дата('00010101') И ПредыдущаяДатаОкончанияПроекта < НачалоДня(
		ТекущаяДата()) Тогда
		ПоказатьПредупреждение( , "Нельзя править дату проекта задним числом!");
		Объект.ДатаОкончания = ПредыдущаяДатаОкончанияПроекта;
		Возврат;
	КонецЕсли;
	//Если текущее значение меньше текущего дня
	Если Объект.ДатаОкончания < НачалоДня(ТекущаяДата()) Тогда
		ПоказатьПредупреждение( , "Дата окончания проекта не должна быть меньше текущей даты!");
		Объект.ДатаОкончания = ПредыдущаяДатаОкончанияПроекта;
	КонецЕсли;
	ИнициализироватьДиаграммуГанта();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПредыдущаяДатаНачалаПроекта = Объект.ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаНачалаПроекта = Объект.ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПредыдущаяДатаОкончанияПроекта = Объект.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаОкончанияПроекта = Объект.ДатаОкончания;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыКомандаПроекта
&НаКлиенте
Процедура КомандаПроектаСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьСотрудниковИОтфильтроватьПоДолжности(Элемент, Элементы.КомандаПроекта.ТекущиеДанные.Должность,
		Элементы.КомандаПроектаСотрудник);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаСотрудникПриИзменении(Элемент)
//TODO: Надо проверить есть ли уже такой сотрудник в списке, 
//если есть не позволять добавить или вообще убрать из вариантов выбора
//	ТекущиеДанные = Элементы.КомандаПроекта.ТекущиеДанные;
//	ПроверкаПересеченияОдногоСотрудникаСГрафикомОтпусков(ТекущиеДанные.Сотрудник,
//										ТекущиеДанные.ПересекаетсяЛиСГрафикомОтпусков);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаДолжностьПриИзменении(Элемент)
//	Очищаем сотрудника и метку пересечения, т.к. надо будет заново выбирать сотрудника 
//	в соответствии с введенной должностью 
	Элементы.КомандаПроекта.ТекущиеДанные.Сотрудник = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаПриИзменении(Элемент)
	ОбновитьТочкиИИнтервалы();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	//Проверяем если добавляется новая запись
	Если НоваяСтрока И Не Копирование Тогда
		Элементы.КомандаПроекта.ТекущиеДанные.ИД = Новый УникальныйИдентификатор;
	КонецЕсли;
	//---------------------------------------
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаПриАктивизацииСтроки(Элемент)
	ОтсортироватьТаблицуИнтервалов();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	СписокВыделенныхСтрокДляУдаления = Новый СписокЗначений;  //СписокЗначений будет отрабатывать корректно, а массив лучше не использовать
	СписокВыделенныхСтрокДляУдаления.ЗагрузитьЗначения(Элемент.ВыделенныеСтроки); //Загружаем в СписокЗначений массив выделенных строк
	МассивИдентификаторовВыделенныхСтрокДляУдаления = Новый Массив;
	Для Каждого Строка Из СписокВыделенныхСтрокДляУдаления Цикл
		Элементы.КомандаПроекта.ТекущаяСтрока = Строка.Значение;
		ИдентификаторУдаляемойСтроки = Элементы.КомандаПроекта.ТекущиеДанные.ПолучитьИдентификатор();
		МассивИдентификаторовВыделенныхСтрокДляУдаления.Добавить(ИдентификаторУдаляемойСтроки);
	КонецЦикла;
	ПараметрыОповещения = Новый Структура("МассивИдентификаторовВыделенныхСтрокДляУдаления",
		МассивИдентификаторовВыделенныхСтрокДляУдаления);
	ОповещениеПриОтветеНаВопрос = Новый ОписаниеОповещения("РезультатОтветаНаВопросОбУдаленииСотрудника", ЭтотОбъект,
		ПараметрыОповещения);
	ПоказатьВопрос(ОповещениеПриОтветеНаВопрос, "Вы действительно хотите удалить сотрудника?",
		РежимДиалогаВопрос.ДаНет, , , );
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаПриАктивизацииПоля(Элемент)
	ОтсортироватьТаблицуИнтервалов();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектаПриАктивизацииЯчейки(Элемент)
	ОтсортироватьТаблицуИнтервалов();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыИнтервалыЗанятостиСотрудников
&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	//Проверяем если добавляется новая запись
	Если НоваяСтрока И Не Копирование Тогда
		//Назначаем ИДшку
		Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.ИД = Элементы.КомандаПроекта.ТекущиеДанные.ИД;
	КонецЕсли;
	ОбновитьТочкиИИнтервалы();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковПослеУдаления(Элемент)
	ОбновитьТочкиИИнтервалы();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковНачалоИнтервалаПриИзменении(Элемент)
	//--Проверяем значение интервала на валидность--

	Если Не ПервичнаяВалидацияДатыИнтервала(Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.НачалоИнтервала,
		ПредыдущаяДатаНачалаИнтервала) Тогда
		Возврат;
	КонецЕсли;
	
	//--Блок кода когда второе значение интервала не пустое--
	
	//Если вторая дата пустая - назад
	Если Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;

	//Если начало больше конца
	НачалоИнтервала = Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.НачалоИнтервала;
	Если НачалоИнтервала > Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала Тогда
		ПоказатьПредупреждение( , "Начало интервала не должно быть больше конца интервала!");
		Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.НачалоИнтервала = ПредыдущаяДатаНачалаИнтервала;
		Возврат;
	КонецЕсли;

	//Проверяем пересечения с другими интервалами
	Если ПроверитьПересеченияИнтерваловСотрудника(Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные) Тогда
		ПоказатьПредупреждение( , "Интервал пересекается с другими интервалами сотрудника!");
		Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.НачалоИнтервала = ПредыдущаяДатаНачалаИнтервала;
		Возврат;
	КонецЕсли;
	//-----------------------------------------------------------------------
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковКонецИнтервалаПриИзменении(Элемент)
	//--Проверяем значение интервала на валидность--

	Если Не ПервичнаяВалидацияДатыИнтервала(Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала,
		ПредыдущаяДатаКонцаИнтервала) Тогда
		Возврат;
	КонецЕсли;
	
	//--Блок кода когда второе значение интервала не пустое--
	
	//Если вторая дата пустая - назад
	Если Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;

	//Если конец меньше начала
	КонецИнтервала = Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала;
	Если КонецИнтервала < Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.НачалоИнтервала Тогда
		ПоказатьПредупреждение( , "Конец интервала не должен быть меньше начала интервала!");
		Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала = ПредыдущаяДатаКонцаИнтервала;
		Возврат;
	КонецЕсли;

	//Проверяем пересечения с другими интервалами
	Если ПроверитьПересеченияИнтерваловСотрудника(Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные) Тогда
		ПоказатьПредупреждение( , "Интервал пересекается с другими интервалами сотрудника!");
		Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала = ПредыдущаяДатаКонцаИнтервала;
		Возврат;
	КонецЕсли;
	//-----------------------------------------------------------------------
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковПриИзменении(Элемент)
	ОбновитьТочкиИИнтервалы();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковНачалоИнтервалаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаНачалаИнтервала = Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.НачалоИнтервала;
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковНачалоИнтервалаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
	СтандартнаяОбработка)
	ПредыдущаяДатаНачалаИнтервала = Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.НачалоИнтервала;
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковКонецИнтервалаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
	СтандартнаяОбработка)
	ПредыдущаяДатаКонцаИнтервала = Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала;
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковКонецИнтервалаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПредыдущаяДатаКонцаИнтервала = Элементы.ИнтервалыЗанятостиСотрудников.ТекущиеДанные.КонецИнтервала;
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыЗанятостиСотрудниковПриАктивизацииСтроки(Элемент)
	ОтсортироватьТаблицуИнтервалов();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОтсортироватьТаблицуИнтервалов()
	//Сортируем таблицу интервалов в соответствии с ИД	
	Если Объект.КомандаПроекта.Количество() <= 0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ИнтервалыЗанятостиСотрудников.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД",
		Элементы.КомандаПроекта.ТекущиеДанные.ИД);
КонецПроцедуры

&НаКлиенте
Функция ПервичнаяВалидацияДатыИнтервала(ДатаИнтервала, ПредыдущаяДатаИнтервала)
	//Если не заданы даты проекта
	Если Объект.ДатаНачала = Дата('00010101') Или Объект.ДатаОкончания = Дата('00010101') Тогда
		ПоказатьПредупреждение( , "Необходимо сперва задать даты проекта!");
		ДатаИнтервала = Дата('00010101');
		Возврат Ложь;
	КонецЕсли;
	//Если пустое значение назад - назад
	Если ДатаИнтервала = Дата('00010101') Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//Если пытаемся править задним числом - назад
	Если Не ПредыдущаяДатаИнтервала = Дата('00010101') И ПредыдущаяДатаИнтервала < НачалоДня(ТекущаяДата()) Тогда
		ПоказатьПредупреждение( , "Нельзя править интервалы задним числом!");
		ДатаИнтервала = ПредыдущаяДатаИнтервала;
		Возврат Ложь;
	КонецЕсли;
	
	//Если текущее значение меньше текущего дня - назад
	Если ДатаИнтервала < НачалоДня(ТекущаяДата()) Тогда
		ДатаИнтервала = ПредыдущаяДатаИнтервала;
		ПоказатьПредупреждение( , "Дата интервала не должна быть меньше текущей даты!");
		Возврат Ложь;
	КонецЕсли;
	
	//Если значение не в пределах дат проекта - назад
	Если ДатаИнтервала < Объект.ДатаНачала Или ДатаИнтервала > Объект.ДатаОкончания Тогда
		ПоказатьПредупреждение( , "Дата интервала должна быть в границах дат проекта!");
		ДатаИнтервала = ПредыдущаяДатаИнтервала;
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура РезультатОтветаНаВопросОбУдаленииСотрудника(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		МассивИдентификаторовВыделенныхСтрокДляУдаления = Параметры.МассивИдентификаторовВыделенныхСтрокДляУдаления;
		Для Каждого Идентификатор Из МассивИдентификаторовВыделенныхСтрокДляУдаления Цикл
			НайденнаяУдаляемаяСтрока = Объект.КомандаПроекта.НайтиПоИдентификатору(Идентификатор);
			Объект.КомандаПроекта.Удалить(НайденнаяУдаляемаяСтрока);
			ОчиститьИнтервалы(НайденнаяУдаляемаяСтрока.ИД);
		КонецЦикла;
	КонецЕсли;
	ОбновитьТочкиИИнтервалы();
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПересеченияИнтерваловСотрудника(ТекущиеДанные)
	//Проверяем на пересечения с другими интервалами
	Для Каждого Строка Из Объект.ИнтервалыЗанятостиСотрудников Цикл
		Если Строка.НомерСтроки = ТекущиеДанные.НомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		Если Не ТекущиеДанные.ИД = Строка.ИД Тогда
			Продолжить;
		КонецЕсли;
		ТекущееНачалоИнтервала = ТекущиеДанные.НачалоИнтервала;
		ТекущийКонецИнтервала = ТекущиеДанные.КонецИнтервала;
		Если ПересекаютсяЛиИнтервалы(ТекущееНачалоИнтервала, ТекущийКонецИнтервала, Строка.НачалоИнтервала,
			Строка.КонецИнтервала) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ПересекаютсяЛиИнтервалы(НовоеНачало, НовыйКонец, ТекущееНачало, ТекущийКонец)
	//Если интервал находится внутри другого
	Если ТекущееНачало <= НовоеНачало И НовоеНачало <= ТекущийКонец И ТекущееНачало <= НовыйКонец И НовыйКонец
		<= ТекущийКонец Тогда
		Возврат Истина;
	//Если задевает левым краем
	ИначеЕсли ТекущееНачало <= НовоеНачало И НовоеНачало <= ТекущийКонец И НовыйКонец >= ТекущийКонец Тогда
		Возврат Истина;
	//Если задевает правым краем
	ИначеЕсли ТекущееНачало >= НовоеНачало И ТекущееНачало <= НовыйКонец И НовыйКонец <= ТекущийКонец Тогда
		Возврат Истина;
	//Если интервал перекрывает другой  
	ИначеЕсли НовоеНачало <= ТекущееНачало И ТекущийКонец <= НовыйКонец Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ОчиститьИнтервалы(ИД)
	//Доавбляем в массив строки на удаление
	МассивИнтервалов = Новый Массив;
	Для Каждого Интервал Из Объект.ИнтервалыЗанятостиСотрудников Цикл
		Если ИД = Интервал.ИД Тогда
			МассивИнтервалов.Добавить(Интервал);
		КонецЕсли;
	КонецЦикла;
	//Удаляем все
	Для Каждого Элемент Из МассивИнтервалов Цикл
		Объект.ИнтервалыЗанятостиСотрудников.Удалить(Элемент);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибке() Экспорт
	ПоказатьПредупреждение( , "Ошибка!");
КонецПроцедуры

&НаСервере
Процедура ОбновитьТочкиИИнтервалы()
	Если Объект.ДатаНачала = Дата('00010101') Или Объект.ДатаОкончания = Дата('00010101') Тогда
		Возврат;
	КонецЕсли;
	Диаграмма = ЗанятостьНаПроектеДиаграмма;
	Диаграмма.УстановитьПолныйИнтервал(Объект.ДатаНачала, Объект.ДатаОкончания + 24 * 60 * 60);
	Диаграмма.Точки.Очистить();
	Для Каждого Запись Из Объект.КомандаПроекта Цикл
		Точка = Диаграмма.УстановитьТочку(Запись.ИД);
		Если Не Запись.Сотрудник.Пустая() Тогда
			Точка.Текст = Запись.Сотрудник.Наименование;
		ИначеЕсли Не Запись.Должность.Пустая() Тогда
			Точка.Текст = Запись.Должность.Наименование;
		Иначе
			Точка.Текст = "Сотрудник";
		КонецЕсли;
		Для Каждого ИнтервалЗанятости Из Объект.ИнтервалыЗанятостиСотрудников Цикл
			Серия = Диаграмма.Серии.Получить(0);
			Если Запись.ИД = ИнтервалЗанятости.ИД Тогда
				Если ИнтервалЗанятости.НачалоИнтервала = Дата('00010101') Или ИнтервалЗанятости.КонецИнтервала = Дата(
					'00010101') Тогда
					Продолжить;
				КонецЕсли;
				ИнтервалДиаграммы = Диаграмма.ПолучитьЗначение(Точка, Серия).Добавить();
				ИнтервалДиаграммы.Начало = ИнтервалЗанятости.НачалоИнтервала;
				ИнтервалДиаграммы.Конец = КонецДня(ИнтервалЗанятости.КонецИнтервала);
				ИнтервалДиаграммы.Текст = "Занятость - " + Строка(ИнтервалЗанятости.ПроцентЗанятости) + "%";
				ИнтервалДиаграммы.Цвет = ВернутьЦветВСоответствииСЗанятостью(ИнтервалЗанятости.ПроцентЗанятости);
	//				ИнтервалДиаграммы.Значение.Редактирование = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Диаграмма.Обновление = Истина;
//	МассивТочек = Диаграмма.Точки;
//	ТочкаНоль = МассивТочек.Получить(0);
КонецПроцедуры

&НаСервере
Функция ВернутьЦветВСоответствииСЗанятостью(Процент)
	Процент25 = Новый Цвет(218, 253, 186);
	Процент50 = Новый Цвет(154, 235, 163);
	Процент75 = Новый Цвет(69, 196, 176);
	Процент100 = Новый Цвет(19, 103, 138);
	Прошлое = WebЦвета.СветлоСерый;

	Если Процент > 0 И Процент <= 25 Тогда
		Возврат Процент25;
	ИначеЕсли Процент > 25 И Процент <= 50 Тогда
		Возврат Процент50;
	ИначеЕсли Процент > 50 И Процент <= 75 Тогда
		Возврат Процент75;
	ИначеЕсли Процент > 75 И Процент <= 100 Тогда
		Возврат Процент100;
	Иначе
		Возврат Прошлое;
	КонецЕсли;

КонецФункции
&НаКлиенте
Процедура ИнициализироватьДиаграммуГанта()
	ЗанятостьНаПроектеДиаграмма.Очистить();
	ЗанятостьНаПроектеДиаграмма.Обновление = Ложь;
	ЗанятостьНаПроектеДиаграмма.АвтоОпределениеПолногоИнтервала = Ложь;

	Диаграмма = ЗанятостьНаПроектеДиаграмма;
	Серия = Диаграмма.УстановитьСерию("Занятость");
	Серия.Текст = "Занятость";
	Серия.Цвет = Новый Цвет(19, 103, 138);
	//Метки
	ЭлементМеток = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементМеток.Единица = ТипЕдиницыШкалыВремени.День;
	ЭлементМеток.ОтображатьПериодическиеМетки = Ложь;
	ЭлементМеток.ЛинииДелений = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);

//	Метка = ЭлементМеток.Метки.Добавить(Объект.ДатаНачала);
//	Метка.Текст = "Начало проекта";
//	Метка.ЦветТекста = WebЦвета.Зеленый;
//	ВыделениеПроекта = Диаграмма.ИнтервалыФона.Добавить(Объект.ДатаНачала, Объект.ДатаНачала + 5 * 60 * 60);
//	ВыделениеПроекта.Цвет = WebЦвета.Зеленый;

	Метка = ЭлементМеток.Метки.Добавить(НачалоДня(ТекущаяДата()));
	Метка.Текст = "СЕГОДНЯ";
	Метка.ЦветТекста = WebЦвета.СинийСоСтальнымОттенком;
	Метка.ЦветЛинии = WebЦвета.СинийСоСтальнымОттенком;
	ВыделениеПроекта = Диаграмма.ИнтервалыФона.Добавить(НачалоДня(ТекущаяДата()), НачалоДня(ТекущаяДата()) + 24 * 60
		* 60);
	ВыделениеПроекта.Цвет = WebЦвета.СинийСоСтальнымОттенком;

//	Метка = ЭлементМеток.Метки.Добавить(Объект.ДатаОкончания);
//	Метка.Текст = "Окончание проекта";
//	Метка.ЦветТекста = WebЦвета.ОранжевоКрасный;
//	ВыделениеПроекта = Диаграмма.ИнтервалыФона.Добавить(Объект.ДатаОкончания, Объект.ДатаОкончания + 5 * 60 * 60);
//	ВыделениеПроекта.Цвет = WebЦвета.ОранжевоКрасный;
	ОбновитьТочкиИИнтервалы();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСотрудниковИОтфильтроватьПоДолжности(Элемент, Должность, Владелец)
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	Элемент = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	Элемент.Использование = Истина;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Должность");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = Должность;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКД);

	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Владелец);
КонецПроцедуры

&НаСервере
Функция ВернутьДолжностьРуководительПроекта()
	Возврат Справочники.Должности.РуководительПроекта;
КонецФункции
#КонецОбласти

//&НаСервере
//Процедура ПроверкаПересеченияОдногоСотрудникаСГрафикомОтпусков(Сотрудник, МеткаПересечения)
//	//Запрос к регистру История Графика Отпусков
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода,
//	|	ИсторияГрафикаОтпусковСрезПоследних.КонецПериода,
//	|	ИсторияГрафикаОтпусковСрезПоследних.Сотрудник,
//	|	ИсторияГрафикаОтпусковСрезПоследних.ДатаНачалаОтпуска,
//	|	ИсторияГрафикаОтпусковСрезПоследних.КоличествоДней КАК КоличествоДней
//	|ИЗ
//	|	РегистрСведений.ИсторияГрафикаОтпусков.СрезПоследних КАК ИсторияГрафикаОтпусковСрезПоследних
//	|ГДЕ
//	|	ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода = &НачалоПериода
//	|	И ИсторияГрафикаОтпусковСрезПоследних.КонецПериода = &КонецПериода
//	|	И ИсторияГрафикаОтпусковСрезПоследних.Сотрудник = &Сотрудник";
//	Запрос.УстановитьПараметр("НачалоПериода", ГрафикОтпусковНачалоПериода);
//	Запрос.УстановитьПараметр("КонецПериода", ГрафикОтпусковКонецПериода);
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	Выборка.Следующий();
//
//	Если Не Сотрудник = Выборка.Сотрудник Тогда
//		МеткаПересечения = Ложь;
//		Возврат;
//	КонецЕсли;
//
//	НачалоОтпуска = Выборка.ДатаНачалаОтпуска;
//	КонецОтпуска = Выборка.ДатаНачалаОтпуска + Выборка.КоличествоДней * 86400;
//	Если (Объект.ДатаНачала <= КонецОтпуска И Объект.ДатаОкончания >= НачалоОтпуска) Тогда
//		МеткаПересечения = Истина;
//	Иначе
//		МеткаПересечения = Ложь;
//	КонецЕсли;
//
//КонецПроцедуры

//&НаСервере
//Процедура АктуализируемПериодГрафикаОтпусков()
//	//Запрос к документу График Отпусков
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	ГрафикОтпусков.НачалоПериода КАК НачалоПериода,
//	|	ГрафикОтпусков.КонецПериода КАК КонецПериода
//	|ИЗ
//	|	Документ.ГрафикОтпусков КАК ГрафикОтпусков
//	|УПОРЯДОЧИТЬ ПО
//	|ГрафикОтпусков.Номер ВОЗР";
//	РезультатЗапроса = Запрос.Выполнить();
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	ВыборкаДетальныеЗаписи.Следующий();
//	ГрафикОтпусковНачалоПериода = ВыборкаДетальныеЗаписи.НачалоПериода;
//	ГрафикОтпусковКонецПериода = ВыборкаДетальныеЗаписи.КонецПериода;
//КонецПроцедуры
//
//&НаСервере
//Процедура ПроверкаПересеченияСотрудниковСГрафикомОтпусков()
//	//Запрос к регистру История Графика Отпусков
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода,
//	|	ИсторияГрафикаОтпусковСрезПоследних.КонецПериода,
//	|	ИсторияГрафикаОтпусковСрезПоследних.Сотрудник,
//	|	ИсторияГрафикаОтпусковСрезПоследних.ДатаНачалаОтпуска,
//	|	ИсторияГрафикаОтпусковСрезПоследних.КоличествоДней КАК КоличествоДней
//	|ИЗ
//	|	РегистрСведений.ИсторияГрафикаОтпусков.СрезПоследних КАК ИсторияГрафикаОтпусковСрезПоследних
//	|ГДЕ
//	|	ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода = &НачалоПериода
//	|	И ИсторияГрафикаОтпусковСрезПоследних.КонецПериода = &КонецПериода";
//	Запрос.УстановитьПараметр("НачалоПериода", ГрафикОтпусковНачалоПериода);
//	Запрос.УстановитьПараметр("КонецПериода", ГрафикОтпусковКонецПериода);
//	РезультатЗапроса = Запрос.Выполнить();
//	ТаблГрафикОтпусков = РезультатЗапроса.Выгрузить();
//
//	//Проверяем пересечения сотрудника в табл части с графиком отпусков
//	Для Каждого СтрокаТЧ Из Объект.КомандаПроекта Цикл
//		Для Каждого Запись Из ТаблГрафикОтпусков Цикл
//			Если Не СтрокаТЧ.Сотрудник = Запись.Сотрудник Тогда
//				Продолжить;
//			КонецЕсли;
//			НачалоОтпуска = Запись.ДатаНачалаОтпуска;
//			КонецОтпуска = Запись.ДатаНачалаОтпуска + Запись.КоличествоДней * 86400;
//			Если (Объект.ДатаНачала <= КонецОтпуска И Объект.ДатаОкончания >= НачалоОтпуска) Тогда
//				СтрокаТЧ.ПересекаетсяЛиСГрафикомОтпусков = Истина;
//			Иначе
//				СтрокаТЧ.ПересекаетсяЛиСГрафикомОтпусков = Ложь;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьИнтервалыВТаблЧасти()
//	Для Каждого Запись Из Объект.КомандаПроекта Цикл
//		Для Каждого Интервал Из Объект.ИнтервалыЗанятостиСотрудников Цикл
//			Если Запись.ИД = Интервал.ИД Тогда	
//				СтандарныйПериод = Новый СтандартныйПериод();	
//				СтандарныйПериод.ДатаНачала = Интервал.НачалоИнтервала;
//				СтандарныйПериод.ДатаОкончания = Интервал.КонецИнтервала;
//				Запись.ИнтервалыЗанятостиСписок.Добавить(СтандарныйПериод);
//			КонецЕсли;
//		КонецЦикла;		
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗанятостьНаПроектеДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
////	СтандартнаяОбработка = Ложь;
//	ПараметрыФормы = Новый Структура;
//	СтандартныйПериод = Новый СтандартныйПериод;
//	
//	//Создаем новый интервал
//	Если Значения.Количество() = 0 Тогда
//		СтандартныйПериод.ДатаНачала = Объект.ДатаНачала;
//		СтандартныйПериод.ДатаОкончания = Объект.ДатаОкончания;
//		ПараметрыФормы.Вставить("ИнтервалПарам", СтандартныйПериод);
//		ОписаниеОповещения = Новый ОписаниеОповещения(
//			"ВозвратЗначенийИзФормыВыбораВДиаграмму", 
//			ЭтотОбъект, ,
//			"СообщитьОбОшибке",
//			ЭтотОбъект);
//		ОткрытьФорму("Документ.Проекты.Форма.ФормаВыбораИнтервала", ПараметрыФормы, Элемент, , , , ОписаниеОповещения, );
//		Возврат;
//	КонецЕсли;
//
//	
//
////	СтандартныйПериод.ДатаНачала = Значения[1].Начало;
////	СтандартныйПериод.ДатаОкончания = Значения[1].Конец;
////	ПараметрыФормы.Вставить("ИнтервалПарам", СтандартныйПериод);
////	ОткрытьФорму("Документ.Проекты.Форма.ФормаВыбораИнтервала", ПараметрыФормы, Элемент);
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратЗначенийИзФормыВыбораВДиаграмму(Массив, Параметр) Экспорт
//	Значение = Массив;
//КонецПроцедуры

