#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Проверим существует ли уже запись в справочнике
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Проекты.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.Проекты КАК Проекты
    |ГДЕ
    |    Проекты.ДокументОснование = &ДокументОснование";
    
    Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        ПроектСпр = Выборка.Ссылка.ПолучитьОбъект();
    Иначе
        ПроектСпр = Справочники.Проекты.СоздатьЭлемент();
    КонецЕсли;
	
	ПроектСпр.ДокументОснование = Ссылка;
	ПроектСпр.Наименование = НазваниеПроекта;
	ПроектСпр.РуководительПроекта = РуководительПроекта;
	ПроектСпр.ДатаНачала = ДатаНачала;
	ПроектСпр.ДатаОкончания = ДатаОкончания;
	ЗаписьВСправочникеПроекты = ПроектСпр.Ссылка;
	
	ПроектСпр.КомандаПроекта.Очистить();
	Для Каждого СтрокаТЧ Из КомандаПроекта Цикл
        НоваяСтрока = ПроектСпр.КомандаПроекта.Добавить();
        НоваяСтрока.Должность = СтрокаТЧ.Должность;
        НоваяСтрока.НеобходимыйПроцентЗанятостиНаПроекте = СтрокаТЧ.НеобходимыйПроцентЗанятостиНаПроекте;
        НоваяСтрока.Сотрудник = СтрокаТЧ.Сотрудник;
	КонецЦикла;
	
    ПроектСпр.Записать();

КонецПроцедуры

#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли