#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Проведение пошло";
        Сообщение.Сообщить();
//	ТекущаяДата = ТекущаяДатаСеанса();
//	УникальныйИдентификатор = Новый УникальныйИдентификатор;
//		
//	МенеджерЗаписи = РегистрыСведений.ИсторияПроектов.СоздатьМенеджерЗаписи();
//	МенеджерЗаписи.Проект = Ссылка;
//	МенеджерЗаписи.НазваниеПроекта = НазваниеПроекта;
//	МенеджерЗаписи.РуководительПроекта = РуководительПроекта;
//	МенеджерЗаписи.ДатаНачала = ДатаНачала;
//	МенеджерЗаписи.ДатаОкончания = ДатаОкончания;
//	МенеджерЗаписи.Период = ТекущаяДата;	
//	МенеджерЗаписи.СтатусПроекта = СтатусПроекта;
//	МенеджерЗаписи.ИдентификаторЗаписи = УникальныйИдентификатор;
//	МенеджерЗаписи.Записать();	
//	
//	Для Каждого СтрокаТЧ Из КомандаПроекта Цикл
//		МенеджерЗаписи = РегистрыСведений.ИсторияСотрудниковНаПроекте.СоздатьМенеджерЗаписи();
//		МенеджерЗаписи.Проект = Ссылка;
//		МенеджерЗаписи.ИДЗаписиВИсторииПроектов = УникальныйИдентификатор;
//		МенеджерЗаписи.Период = ТекущаяДата;
//		МенеджерЗаписи.Сотрудник = СтрокаТЧ.Сотрудник;
//		МенеджерЗаписи.Должность = СтрокаТЧ.Должность;
//		МенеджерЗаписи.НеобходимыйПроцентЗанятостиНаПроекте = СтрокаТЧ.НеобходимыйПроцентЗанятостиНаПроекте;
//		МенеджерЗаписи.Записать();			
//	КонецЦикла;

//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	
//	СписокЗначений = Новый СписокЗначений();
//	
//
//	// регистр СотрудникиНаПроектах
//	Движения.СотрудникиНаПроектах.Записывать = Истина;
//	Для Каждого ТекСтрокаКомандаПроекта из КомандаПроекта Цикл
//		Интервалы = ТекСтрокаКомандаПроекта.ИнтервалыЗанятостиНаПроекте;
//		Интервалы.Получить();
////		Движение = Движения.СотрудникиНаПроектах.Добавить();
////		Движение.Период = Дата;
////		Движение.Проект = Ссылка;
////		Движение.Сотрудник = ТекСтрокаКомандаПроекта.Сотрудник;
////		Движение.Должность = ТекСтрокаКомандаПроекта.Должность;
//	КонецЦикла;
//
//	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли