#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	ТекущаяДата = ТекущаяДатаСеанса();
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
		
	МенеджерЗаписи = РегистрыСведений.ИсторияПроектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Проект = Ссылка;
	МенеджерЗаписи.НазваниеПроекта = НазваниеПроекта;
	МенеджерЗаписи.РуководительПроекта = РуководительПроекта;
	МенеджерЗаписи.ДатаНачала = ДатаНачала;
	МенеджерЗаписи.ДатаОкончания = ДатаОкончания;
	МенеджерЗаписи.Период = ТекущаяДата;	
	МенеджерЗаписи.СтатусПроекта = СтатусПроекта;
	МенеджерЗаписи.ИдентификаторЗаписи = УникальныйИдентификатор;
	МенеджерЗаписи.Записать();	
	
	Для Каждого СтрокаТЧ Из КомандаПроекта Цикл
		МенеджерЗаписи = РегистрыСведений.ИсторияСотрудниковНаПроекте.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Проект = Ссылка;
		МенеджерЗаписи.ИДЗаписиВИсторииПроектов = УникальныйИдентификатор;
		МенеджерЗаписи.Период = ТекущаяДата;
		МенеджерЗаписи.Сотрудник = СтрокаТЧ.Сотрудник;
		МенеджерЗаписи.Должность = СтрокаТЧ.Должность;
		МенеджерЗаписи.НеобходимыйПроцентЗанятостиНаПроекте = СтрокаТЧ.НеобходимыйПроцентЗанятостиНаПроекте;
		МенеджерЗаписи.Записать();			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли